# UserModifiable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDefinition..::..UserModifiable Property
ExternalDefinition Class See Also
---
Indicates whether the parameter can be modified by the user interface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool UserModifiable { get; }
```

Visual Basic
---
```text
Public ReadOnly Property UserModifiable As Boolean
	Get
```

Visual C++
---
```text
public:
property bool UserModifiable {
	bool get ();
}
```

# Remarks
If true, the user can edit the value of this parameter. If false, the user cannot edit this value (it will appear grayed out). However, any API application can modify the value of this parameter.
# See Also
ExternalDefinition Class
Autodesk.Revit.DB Namespace